init.el
(setenv "LDFLAGS" "-L/opt/homebrew/opt/openssl@3/lib")
(setenv "CFLAGS" "-I/opt/homebrew/opt/openssl@3/include")

(add-to-list 'exec-path "~/.nix-profile/bin")
(add-to-list 'exec-path "/opt/homebrew/bin")
(add-to-list 'exec-path "/usr/local/bin")
(add-to-list 'exec-path "~/.cargo/bin")
(add-to-list 'exec-path "~/go/bin")
(add-to-list 'exec-path "/opt/homebrew/Cellar/libgccjit/13.2.0/lib/gcc/current/")

(setenv "PATH"
		(concat
		 (mapconcat #'identity exec-path path-separator)
		 "/opt/homebrew/opt/llvm@14/bin" path-separator
		 "~/.emacs.d/bin" path-separator
		 "/opt/local/bin" path-separator
		 "/opt/local/sbin" path-separator
		 "/opt/homebrew/sbin" path-separator
		 "/System/Cryptexes/App/usr/bin" path-separator
		 "/usr/bin" path-separator
		 "/bin" path-separator
		 "/usr/sbin" path-separator
		 "/sbin" path-separator
		 "/usr/local/go/bin" path-separator
		 "/Library/TeX/Distributions/Programs/texbin"))

(add-hook 'after-init-hook (lambda () (message (emacs-init-time))))

(global-auto-revert-mode 1)
(save-place-mode 1)
(recentf-mode 1)
(setq recentf-max-menu-items 50
	  recentf-max-saved-items 50)

(setq make-backup-files nil)

(setq inhibit-startup-screen t
	  use-dialog-box nil
	  ns-pop-up-frames nil)

(setq read-process-output-max (* 1024 1024))
(setq gc-cons-threshold 100000000
	  gc-cons-percentage 0.5)

(setq initial-scratch-message nil)

(setq dired-dwim-target t)

(setq column-number-mode t)
(blink-cursor-mode -1)

(pixel-scroll-mode)
(setq pixel-dead-time 0)
(setq pixel-resolution-fine-flag t)
(setq mouse-wheel-scroll-amount '(1))
(setq mouse-wheel-progressive-speed nil)

(setq gamegrid-glyph-height-mm 7)

(add-hook 'tetris-mode-hook 'visual-fill-column-mode)

(let ((sh-path "/run/current-system/sw/bin/fish"))
  (if (file-exists-p sh-path)
	  (setq-default explicit-shell-file-name sh-path)
	(message "fish shell not found")))

(setq ns-alternate-modifier 'meta
	  ns-right-alternate-modifier 'none)

(global-set-key (kbd "C-c r") #'recentf)

(when (fboundp 'windmove-default-keybindings)
  (windmove-default-keybindings 'control))

(setq mouse-autoselect-window t)

(global-set-key (kbd "C-x C-1") #'delete-other-windows)
(global-set-key (kbd "C-x C-2") #'split-window-below)
(global-set-key (kbd "C-x C-3") #'split-window-right)
(global-set-key (kbd "C-x C-0") #'delete-window)

(global-set-key [wheel-right] #'(lambda () (interactive) (scroll-left 4)))
(global-set-key [wheel-left] #'(lambda () (interactive) (scroll-right 4)))

(defun user/get-current-buffer-directory ()
  "Get the directory of the current buffer."
  (if (and (buffer-file-name)
           (file-exists-p (buffer-file-name)))
      (file-name-directory (buffer-file-name))
    default-directory))

(defun user/macos-fullscreen-tile-terminal ()
  "Fullscreen tile Terminal window to the right half of the screen with the current directory opened."
  (interactive)
  (let* ((current-dir (user/get-current-buffer-directory))
         (escaped-dir (shell-quote-argument (expand-file-name current-dir))))
    
		(start-process 
     "terminal-tile" 
     nil 
     "osascript" 
     "-e" 
     (format "
tell application \"Terminal\"
    do script \"cd %s\"
end tell

tell application \"System Events\" to tell process \"Terminal\"
    set frontmost to true
        
    tell menu bar 1 to tell menu \"Window\" of menu bar item \"Window\"
        click menu item \"Right of Screen\" of menu \"Full Screen Tile\" of menu item \"Full Screen Tile\"
    end tell
end tell" escaped-dir))
		))

(global-set-key (kbd "C-c t") 'user/macos-fullscreen-tile-terminal)

(setq visible-bell t)
(setq-default tab-width 2)

(global-set-key (kbd "C-x s") #'replace-string)

(require 'org)

(setq org-startup-indented t
	  org-confirm-babel-evaluate nil
	  org-edit-src-content-indentation 0
	  org-image-actual-width nil
	  org-support-shift-select t)

(defun user/indent-org-block ()
  (interactive)
  (when (org-in-src-block-p)
    (org-edit-special)
    (indent-region (point-min) (point-max))
    (org-edit-src-exit)))

(define-key org-mode-map (kbd "C-i") #'user/indent-org-block)

(defun toggle-org-html-export-on-save ()
  (interactive)
  (if (memq 'org-html-export-to-html after-save-hook)
      (progn
        (remove-hook 'after-save-hook 'org-html-export-to-html t)
        (message "Disabled org html export on save for current buffer..."))
    (add-hook 'after-save-hook 'org-html-export-to-html nil t)
    (message "Enabled org html export on save for current buffer...")))

(setq-default TeX-engine 'xetex)

(setq c-basic-offset 2)
(setq c-indent-level 2)
(setq c-ts-mode-indent-offset 2)
(setq tab-width 2)

(defun user/outline-level ()
  "Custom outline level based on the comment labels."
  (looking-at outline-regexp)
  (let ((match (match-string 0)))
    (if (null match) 1
      (length match))))

(add-hook 'c-mode-common-hook
          (lambda ()
            (outline-minor-mode 1)
            (setq outline-regexp "//=:[a-zA-Z]+\\(:[a-zA-Z]+\\)?")
            (setq outline-level 'user/outline-level)
						(hide-body)))

(global-set-key (kbd "C-c i") 'outline-hide-body)
(global-set-key (kbd "C-c o") 'outline-hide-other)
(global-set-key (kbd "C-c p") 'outline-show-entry)
(global-set-key (kbd "C-c u") 'outline-show-all)

(setq ispell-program-name "aspell") 
(setq ispell-list-command "list")

(setq epa-pinentry-mode 'loopback)

(setq treesit-language-source-alist
	  '((bash "https://github.com/tree-sitter/tree-sitter-bash")
		(c "https://github.com/tree-sitter/tree-sitter-c")
		(cmake "https://github.com/uyha/tree-sitter-cmake")
		(common-lisp "https://github.com/theHamsta/tree-sitter-commonlisp")
		(cpp "https://github.com/tree-sitter/tree-sitter-cpp")
		(css "https://github.com/tree-sitter/tree-sitter-css")
		(csharp "https://github.com/tree-sitter/tree-sitter-c-sharp")
		(elisp "https://github.com/Wilfred/tree-sitter-elisp")
		(go "https://github.com/tree-sitter/tree-sitter-go")
		(go-mod "https://github.com/camdencheek/tree-sitter-go-mod")
		(html "https://github.com/tree-sitter/tree-sitter-html")
		(js . ("https://github.com/tree-sitter/tree-sitter-javascript" "master" "src"))
		(json "https://github.com/tree-sitter/tree-sitter-json")
		(lua "https://github.com/Azganoth/tree-sitter-lua")
		(make "https://github.com/alemuller/tree-sitter-make")
		(markdown "https://github.com/ikatyang/tree-sitter-markdown")
		(python "https://github.com/tree-sitter/tree-sitter-python")
		(r "https://github.com/r-lib/tree-sitter-r")
		(rust "https://github.com/tree-sitter/tree-sitter-rust")
		(toml "https://github.com/tree-sitter/tree-sitter-toml")
		(tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src"))
		(typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src"))
		(typst "https://github.com/uben0/tree-sitter-typst")
		(yaml "https://github.com/ikatyang/tree-sitter-yaml")
		(nix "https://github.com/nix-community/tree-sitter-nix")))

(add-to-list 'auto-mode-alist '("\\.ya?ml\\'" . yaml-ts-mode))
