init.el

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

(use-package doom-themes
  :custom
  (doom-themes-enable-bold t)
  (doom-themes-enable-italic t)
  :config
  (load-theme 'doom-gruvbox t)

  (doom-themes-visual-bell-config)
  (doom-themes-org-config))

(use-package all-the-icons
  :if (display-graphic-p))

(use-package all-the-icons-dired
  :after all-the-icons
  :straight (:type git :host github :repo "jtbm37/all-the-icons-dired")
  :config
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))

(use-package all-the-icons-ivy-rich
  :after (all-the-icons ivy-rich)
  :init (all-the-icons-ivy-rich-mode 1))

(use-package projectile
  :config
  (projectile-mode +1)
  (define-key projectile-mode-map (kbd "M-p") 'projectile-command-map))

(use-package dashboard
  :after (projectile all-the-icons)
  :custom
  (dashboard-items '((recents  . 7)
                     (projects . 4)
                     (agenda . 2)
                     (registers . 2)
					 (bookmarks . 4)))
  (dashboard-icon-type 'all-the-icons)
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  (dashboard-startup-banner 'ascii)
  (dashboard-banner-logo-title nil)
  (dashboard-set-init-info nil)
  :config
  (dashboard-setup-startup-hook))

(use-package dired-subtree
	:config
	(define-key dired-mode-map "i" 'dired-subtree-toggle)
	(advice-add 'dired-subtree-toggle :after (lambda ()
                                             (interactive)
                                             (when all-the-icons-dired-mode
                                               (revert-buffer)))))

;; (use-package vterm
;; 	:custom
;; 	(shell-file-name explicit-shell-file-name))

(use-package expand-region
  :bind ("C-=" . er/expand-region))

(use-package move-text)
(move-text-default-bindings)

(use-package queue)
(use-package undo-tree
	:after queue
	:config
	(global-undo-tree-mode))

(use-package avy
	:config
	(global-set-key (kbd "C-w") 'avy-goto-word-0))

;; (use-package god-mode
;;   :config
;;   (global-set-key (kbd "<escape>") #'god-mode)

;;   (define-key god-local-mode-map (kbd "z") #'repeat)
  
;;   (define-key god-local-mode-map (kbd "[") #'backward-paragraph)
;;   (define-key god-local-mode-map (kbd "]") #'forward-paragraph))

;; (defun user/god-mode-update-cursor ()
;;   (if (or god-local-mode buffer-read-only)
;; 	  (set-cursor-color "cyan")
;; 	(set-cursor-color "white")))

;; (add-hook 'post-command-hook #'user/god-mode-update-cursor)

(use-package devil)

(use-package multiple-cursors
  :config
  (global-set-key (kbd "C-s-c") 'mc/edit-lines)
  (global-set-key (kbd "C-(") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-)") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-c C-(") 'mc/mark-all-like-this)
  (global-set-key (kbd "s-<mouse-1>") 'mc/add-cursor-on-click))

(use-package kaomel
  :straight  (:type git :host github :repo "gicrisf/kaomel")
	:custom
	(kaomel-path "~/.emacs.d/kaomoji.json"))

(global-set-key (kbd "C-s-k") #'kaomel-insert)

(use-package yasnippet
  :custom
  (yas-snippet-dirs '(;; "~/.emacs.d/user_snippets"
					  "~/.emacs.d/AndreaCrotti_snippets"))
  :config
  (yas-global-mode 1))

(use-package jinx
  :hook (emacs-startup . global-jinx-mode)
  :bind (("C-c c" . jinx-correct)
         ("C-c l" . jinx-languages)))

(use-package which-key
  :config
  (which-key-mode))

(use-package ivy
  :config
  (ivy-mode)

  (global-set-key (kbd "C-r") 'swiper-thing-at-point)
  (global-set-key (kbd "C-s") 'swiper))

(use-package counsel
  :after ivy
  :config
  (counsel-mode))

(use-package ivy-rich
  :after ivy
  :config
  (ivy-rich-mode 1)
  (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line))

(use-package magit)

(use-package nix-ts-mode
	:mode "\\.nix\\'")

(setenv "PYTHONIOENCODING" "utf8")

(setq python-shell-interpreter-args "-m asyncio")

(use-package lsp-pyright
  :hook (python-mode . (lambda () (require 'lsp-pyright)))
  :init (when (executable-find "python3")
          (setq lsp-pyright-python-executable-cmd "python3")))

(use-package py-autopep8
	:custom
	(py-autopep8-options '("--max-line-length=80")))

(use-package pyvenv
  :config
  (pyvenv-tracking-mode)
  (add-hook 'pyvenv-post-activate-hooks 'lsp))

(use-package ein)

(use-package typescript-mode)
(use-package tide
  :ensure t
  :after (typescript-mode company flycheck)
  :hook ((typescript-mode . tide-setup)
         (typescript-mode . tide-hl-identifier-mode)
         (before-save . tide-format-before-save))
	:config
	(add-hook 'js2-mode-hook #'setup-tide-mode)
	;; configure javascript-tide checker to run after your default javascript checker
	(flycheck-add-next-checker 'javascript-eslint 'javascript-tide 'append))

(defun user/clang-format-save-hook-for-this-buffer ()
  "Create a buffer local save hook."
  (add-hook 'before-save-hook
            (lambda ()
              (when (locate-dominating-file "." ".clang-format")
                (clang-format-buffer))
              ;; Continue to save.
              nil)
            nil
            ;; Buffer local hook.
            t))

(use-package clang-format
	:hook
	((c-mode . (lambda () (user/clang-format-save-hook-for-this-buffer)))))

(add-to-list 'major-mode-remap-alist '(c-mode . c-ts-mode))

(use-package rustic
  :mode ("\\.rs\\'" . rustic-mode)
  :custom
  (rustic-format-on-save t))

(use-package zig-mode)

(use-package go-mode)

(use-package ob-go
	:after go-mode)

(use-package fgscript-mode
  :straight (:type git :host github :repo "mandriota/fgscript"
                   :files ("editors/emacs/fgscript-mode.el")))

(use-package fish-mode
  :mode ("\\.fish$")
  :config
  (setq fish-enable-auto-indent t))

(use-package ob-fish
  :straight  (:type git :host github :repo "takeokunn/ob-fish"))

(use-package csv-mode)

(use-package typst-ts-mode
  :straight (:type git :host codeberg :repo "meow_king/typst-ts-mode")
  :custom
  (typst-ts-mode-watch-options "--open"))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (C . t)
	 (shell . t)))

(use-package dap-mode)

(use-package flycheck)
