init.el

(use-package lsp-mode
  :ensure
  :commands lsp
  :custom
	(lsp-enable-file-watchers nil)
  (lsp-rust-analyzer-cargo-watch-command "clippy")
  (lsp-eldoc-render-all nil)
  ;;(lsp-inlay-hint-enable t)
	(lsp-headerline-breadcrumb-enable nil)
  (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
  (lsp-rust-analyzer-display-chaining-hints t)
  (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
  (lsp-rust-analyzer-display-closure-return-type-hints t)
  (lsp-rust-analyzer-display-parameter-hints nil)
  (lsp-rust-analyzer-display-reborrow-hints nil)
	(lsp-go-analyses '((simplifycompositelit . :json-false)))
	:hook ((lsp-mode . lsp-enable-which-key-integration)
				 (typescript-mode . lsp)
				 (javascript-mode . lsp)
				 (python-mode . lsp)
				 (python-mode . py-autopep8-mode)
				 (elisp-mode . lsp)
				 (go-mode . lsp)
				 (rustic . lsp)
				 (c-mode . lsp)
				 (c-ts-mode . lsp)
				 (zig . lsp))
  :config
  (add-hook 'lsp-mode-hook 'lsp-ui-mode)
	(require 'dap-cpptools))

(use-package lsp-ui
  :ensure
  :commands lsp-ui-mode
  :custom
  (lsp-ui-peek-always-show t)
  (lsp-ui-sideline-show-hover t)
  (lsp-ui-doc-enable t)
	(lsp-ui-sideline-enable nil))

(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)

(use-package company
  :custom
  (company-idle-delay 0)
  (company-minimum-prefix-length 1)
  (company-selection-wrap-around t)
  :config
  (add-hook 'after-init-hook 'global-company-mode)
  (global-set-key (kbd "C-c y") 'company-yasnippet)

  (company-tng-configure-default))

(use-package visual-fill-column
  :commands visual-fill-column-mode
  :custom
  (visual-fill-column-center-text t)
  (visual-fill-column-width 90))

(use-package nov
  :custom
  (nov-text-width t)
  :config
	(defun user/nov-font-setup ()
	  (face-remap-add-relative 'variable-pitch :family "Georgia"
                               :height 1.2))
	(add-hook 'nov-mode-hook 'user/nov-font-setup)
	
  (add-hook 'nov-mode-hook 'visual-line-mode)
  (add-hook 'nov-mode-hook 'visual-fill-column-mode)

  (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode)))

(unless (server-running-p)
	(server-start))
